{
  "title": "Ichigo Kurosaki",
  "characterQuote": "\"...If fate is a millstone, then we are the grist. There is nothing we can do. So I wish for strength. If I cannot protect them from the wheel, then give me a strong blade, and enough strength... to shatter fate.\"\n",
  "image": "https://static.wikia.nocookie.net/bleach/images/4/41/NBFHIchigo_profile.png/revision/latest/scale-to-width-down/290?cb=20210809170351&path-prefix=en",
  "description": "Ichigo Kurosaki (黒崎 一護, Kurosaki Ichigo) is a Human who is also a Substitute Shinigami. Ichigo is the son of Isshin and Masaki Kurosaki, and older brother of Karin and Yuzu. He is also married to Orihime Inoue and has a son named Kazui Kurosaki.\n",
  "race": "Human (Quincy)",
  "birthday": "July 15[1]",
  "gender": "Male",
  "height": "174 cm (5'8½\")[2] (formerly)  181 cm (5'11¼\")[3]",
  "weight": "61 kg (134 lbs.)[2] (formerly)  66 kg (145 lbs.)[3]",
  "occupation": "High School Student  Substitute Shinigami  Errand Boy of the Unagiya Shop  Translator[4]",
  "affiliation": "Kurosaki Clinic  Ichigo's Group  Karakura Town  Loosely Soul SocietyUnofficially Visored  Xcution",
  "profession": "",
  "previousposition": "",
  "previousdivision": "",
  "previouspartner": "",
  "baseofoperations": "Kurosaki Clinic,  Karakura Town",
  "shikai": "Zangetsu",
  "bankai": "Tensa Zangetsu",
  "powersandabilities": [
    "Expert Hand-to-Hand Combatant: Physically, Ichigo's Human body is in top form. Ichigo has been trained in martial arts since he was a small child, both professionally and by his father. He has repeatedly shown great agility and coordination in his attacks. In addition to having powerful kicks and punches, Ichigo is proficient in counterattacks, takedowns, and body locks. He has repeatedly caught an opponent's weapon strikes with a single hand.[539] He effortlessly defeats multiple bullies and gangsters on a regular basis, and is a better martial artist than Tatsuki Arisawa, who is officially ranked the second strongest fighter of her age group in all of Japan despite her fighting with a broken arm. Combined with his speed, he effortlessly knocked out three lieutenants in rapid succession, while bare-handed, with a single strike each before the first lieutenant even touched the ground.[540] While he has stopped training, constant attacks from bullies and his father keep his skills fresh.",
    "Enhanced Strength: Even while not in his Shinigami form, Ichigo is deceptively strong, smashing a man's head through a concrete road with a single kick,[541] and later kicking Asguiaro Ebern from his bedroom into the street without injuring his leg from the man's Hierro.[542]",
    "Enhanced Speed & Reflexes: Even before learning Shunpo, Ichigo is a very fast and agile fighter. Ichigo possesses great reflexes, dodging a strike with no wasted effort and immediately counterattacking.[543] He can strike quickly, without warning, and in rapid succession.[544] His speed allows him to follow the movements of faster opponents to better analyze their movements, and block otherwise fatal strikes.[545] Even when struck by surprise by Tenjirō Kirinji, who is fast enough to outpace Suì-Fēng, Ichigo counterattacked and injured said attacker without anybody else noticing.[546] Ichigo managed to dodge a surprise point-blank shot to the head and attempt to perform a counter against Robert Accutrone, who was fast enough to match and pressure a fast Captain such as Shunsui in terms of speed.[547]",
    "Enhanced Durability: While only a teenage Human, Ichigo is a highly resilient young man, safely breaking free from a binding spell (albeit a low-level one) and withstanding an assault from a large Hollow.[541]",
    "Advanced Growth Rate: According to both Aizen and Urahara, Ichigo's most astounding ability is his growth rate; he grasps the basic control of advanced techniques in days where it would take several years for even the most gifted Shinigami. Shortly after gaining Shinigami powers and with no previous training, he began learning advanced spiritual energy sensing techniques by sheer instinct. While it takes most Shinigami at least 10 years to achieve Bankai, he did so in two-and-a-half days (albeit with the assistance of a special device invented by Urahara which was originally intended for three days).[548][549] He gains considerable experience in the use of Shunpo while training with Yoruichi, which was done over the same period as his Bankai.[550] Besides his improvements in his Shinigami abilities, Ichigo greatly increased the time he could maintain his Hollow mask, from eleven seconds to considerably longer amounts of time. During his first fight with Ulquiorra, he is instantly incapacitated by one Cero blast, even with his Hollow mask (which broke within a second), but only a few hours later, he withstands another Cero from Ulquiorra without undergoing Hollowfication, and can analyze Ulquiorra's movements much better than before, when he had \"felt like [he] was fighting a machine or a statue\" and failed to predict and counter his attacks.[551][552] His latent abilities have been recognized by the Wandenreich as potent enough to make him one of the Special War Powers of Soul Society.[553] ",
    "Keen Intellect: Despite his somewhat punkish attitude, Ichigo is analytical, perceptive, and deductive. In his high school, Ichigo's grades are almost always near the top, despite his work as a Substitute Shinigami. Aside from that, Ichigo can determine the pattern of his opponent's battle methods and form a proper counter-strategy to defeat his opponent's attacks.",
    "Immeasurable Spiritual Power: Ichigo has been noted on several occasions to have tremendously vast levels of spiritual energy, well-beyond most other Shinigami.[554] His spiritual power is noted to be heavy, which surprised Renji Abarai.[555] Ichigo constantly gives off Reiatsu at the level of a captain.[556] Even when worn-out in battle, he can continue fighting effectively while still using Getsuga Tenshō and his Bankai.[557] Even at less than half strength, his spiritual energy is comparable to a captain-level fighter.[558] His energy is strong enough to hold back the Sōkyoku, a halberd with the destructive force equivalent to one million Zanpakutō combined, using only his Zanpakutō.[559] Even before his Dangai training, his spiritual energy was strong enough for him to be able to sense Aizen's increased Reiatsu as a result of his Second Fusion with the Hōgyoku while fighting Gin from a considerable distance away, despite his father, Urahara, and Yoruichi, all former Gotei 13 Captains, being unable to do so themselves while fighting him directly.[560][561] His Reiatsu is golden yellow in color.[562] After his training at the Soul King Palace, Ichigo was able to overwhelm four Sternritter simultaneously[563] and then calmly fight on par with a Sternritter using Quincy: Vollständig using just his Shikai and eventually overpower his foe.[564]",
    "Spiritual Awareness: Since he was a child, Ichigo has had an innate ability to clearly see spiritual beings and sense their presence. After becoming a Shinigami, his senses have continued to improve with time, learning various advanced sensing techniques, such as using a spirit ribbon to find Yūichi Shibata (in bird form).[570] Even from a considerable distance, he can detect the condition of a being with spiritual power. During his intense fight against Kenpachi Zaraki, he clearly sensed and recognized Sado's energy signature even as it weakened, despite the considerable distance between them.[571]",
    "Master Swordsman: In terms of fighting style while in his Shinigami form, Ichigo relies mainly on swordplay. Aside from his initial training with Urahara, he is essentially on a \"learn as you go\" training regimen; thusly, his skill has developed by fighting rather than formal instruction, becoming even more capable with every fight. His overall skill allows him to fight evenly against sword masters of Byakuya Kuchiki and Kenpachi Zaraki's caliber. While usually fighting right-handed, Ichigo appears to be ambidextrous, as he is proficient in wielding Zangetsu in his left hand.[572][573][574] Since attaining the true form of Zangetsu, he has displayed great skill at wielding both blades at once without any trouble.[575][576][577][578][579][580]",
    "Shunpo Expert: Though not particularly versed in its various techniques, Ichigo is proficient enough in the technique itself to keep up with and even surprise high-level Shinigami with his speed. Byakuya Kuchiki, one of the most proficient users of Shunpo in Soul Society, complimented Ichigo's growing mastery of the technique.[581] During his first demonstration of this skill, he knocked out three lieutenants and grabbed his Zanpakutō before any of them hit the ground.[540] After returning from the Soul King Palace, Ichigo has refined his skill in Shunpo, moving several miles in a single leap while simultaneously bypassing the perception of multiple Sternritter.[582]",
    "Enhanced Strength: When he is in his Shinigami body, Ichigo's already impressive strength is greatly enhanced. He has knocked out three Shinigami lieutenants with a single punch each, one of which shattered one of their Zanpakutō at the same time.[540] His strength is great enough to easily stop repeated axe blows from Jidanbō before shattering Jidanbō's axes in a single swing, and hurl Rukia a dozen meters into Renji's arms and send them both skidding several meters more, achieving both feats with a single hand.[583][584] With a single kick, he can break down and launch a large chunk of a stone wall.[585] After regaining his Shinigami powers, one swing from his Zanpakutō produced a shockwave powerful enough to overwhelm Kūgo Ginjō, making the Fullbringer mistake it for a Getsuga Tenshō.[586] When fighting Quilge Opie, Ichigo grabbed one of his Heilig Pfeil with his bare hand without sustaining any damage, despite the considerable explosion it caused when Ichigo threw it back.[587] After returning from the Soul King Palace, Ichigo has increased in strength, allowing him to throw four Sternritter into separate buildings in rapid succession without any visible effort.[588]",
    "Immense Endurance: When in his Shinigami form, Ichigo's endurance is strengthened to the point where he can continue fighting effectively after receiving many injuries, and can survive attacks which would easily kill normal Humans. It was stated by Rukia that a Shinigami's life force is their spiritual power. As such, Ichigo can withstand attacks which would be fatal to most Shinigami.[589] Uryū once stated Ichigo was a monster in this regard,[590] and Aizen commented on his ability to continue moving despite grave injuries.[591]",
    "Enhanced Durability: Ichigo becomes much more durable in his Shinigami form. During his last fight with Kūgo Ginjō, he withstood a direct hit from the Getsuga Tenshō created by his opponent, and the damage was only done to one of his arms and part of his face.[592] When fighting Quilge Opie, Ichigo withstood the impact of several Heilig Pfeil fired at him, unharmed, despite the powerful explosion each one caused.[593] Tenjirō Kirinji, a member of the Royal Guard, was amazed at Ichigo's ability to endure the unique healing properties of his White Skeleton Pond and Blood Hell Pond for so long after fully healing without rotting.[594] After his training in the Soul King Palace, his durability has increased to the point where he can withstand a direct attack from Meninas McAllon with only scratches on his face and retain the ability to move afterward, something which Robert Accutrone commended him for.[595]",
    "Zangetsu (斬月, Slaying Moon)",
    "",
    "",
    "Blut (血装 (ブルート), burūto; German for \"Blood,\" Japanese for \"Blood Guise\"): A Quincy ability which gives one inhuman defensive & offensive capability. ",
    "",
    "The anime has frequently downplayed the extent of the injuries inflicted by and upon Ichigo, including reducing the amount of bleeding[541][752] and burn marks,[753][754] showing extreme injuries in shillouette such as the Hollow Hexapodus being stabbed in the head,[755][756] or generally reducing the severity of injuries.[757][758]",
    ""
  ],
  "plot": "\n\nNote: Events occurring in this arc are only in the anime and do not constitute canon material.\n\n\nNote: Events occurring in this arc are only in the anime and do not constitute canon material.\n\nNote: Events occurring in this arc are only in the anime and do not constitute canon material.\nNote: Events occurring in this arc are only in the anime and do not constitute canon material.\nNote: Events occurring in this arc are only in the anime and do not constitute canon material.\n\n\nThree hours before Ukitake's Konsō Reisai, Ichigo is contacted by Renji on a video call and informed of the ceremony, which he considers unethical, as well as him being invited to attend it by Shunsui and Rukia, who joins Renji and marvels at the new technology. When Ichigo reveals that Orihime is at home doing laundry instead of at Keigo's ramen shop with him, he is astonished when Rukia assumes that this means their marriage is crumbling, something that he angrily denies, and learns of the latter's exposure to television following Urahara's recent work with the Shinigami Research and Development Institute.[525]\nThat night, Ichigo gathers with Renji and the other lieutenants in the Human World for the Jogimen Reibaku ceremony, where he questions the need for them all to be there and is introduced to 7th Division Lieutenant Atau Rindō as well as 8th Division Lieutenant Yuyu Yayahara, who immediately accosts him for a selfie to post on social media since she knows Ichigo is the hero of the Quincy Blood War despite Ichigo's confusion and protests. However, as Ichigo continues talking with Renji, he fails to notice a Jigoku no Gaki appearing behind them before it attacks Renji, sending him crashing into the ground below.[526]\nAfter cutting the Jigoku no Gaki to pieces with a single slash of his sword, Ichigo intervenes in Renji's confrontation with Szayelaporro Granz after the latter rises from Hell to free Renji and take on Szayelaporro himself, where he learns that the true purpose of the Konsō Reisai is to send deceased captains to Hell, leaving Ichigo aghast. Once Ukitake impales Szayelaporro to drag him back into Hell, Ichigo is left to wonder why the Jigokuchō have the word \"Hell\" in their names.[527]\n\nExpert Hand-to-Hand Combatant: Physically, Ichigo's Human body is in top form. Ichigo has been trained in martial arts since he was a small child, both professionally and by his father. He has repeatedly shown great agility and coordination in his attacks. In addition to having powerful kicks and punches, Ichigo is proficient in counterattacks, takedowns, and body locks. He has repeatedly caught an opponent's weapon strikes with a single hand.[539] He effortlessly defeats multiple bullies and gangsters on a regular basis, and is a better martial artist than Tatsuki Arisawa, who is officially ranked the second strongest fighter of her age group in all of Japan despite her fighting with a broken arm. Combined with his speed, he effortlessly knocked out three lieutenants in rapid succession, while bare-handed, with a single strike each before the first lieutenant even touched the ground.[540] While he has stopped training, constant attacks from bullies and his father keep his skills fresh.\nEnhanced Strength: Even while not in his Shinigami form, Ichigo is deceptively strong, smashing a man's head through a concrete road with a single kick,[541] and later kicking Asguiaro Ebern from his bedroom into the street without injuring his leg from the man's Hierro.[542]\nEnhanced Speed & Reflexes: Even before learning Shunpo, Ichigo is a very fast and agile fighter. Ichigo possesses great reflexes, dodging a strike with no wasted effort and immediately counterattacking.[543] He can strike quickly, without warning, and in rapid succession.[544] His speed allows him to follow the movements of faster opponents to better analyze their movements, and block otherwise fatal strikes.[545] Even when struck by surprise by Tenjirō Kirinji, who is fast enough to outpace Suì-Fēng, Ichigo counterattacked and injured said attacker without anybody else noticing.[546] Ichigo managed to dodge a surprise point-blank shot to the head and attempt to perform a counter against Robert Accutrone, who was fast enough to match and pressure a fast Captain such as Shunsui in terms of speed.[547]\nEnhanced Durability: While only a teenage Human, Ichigo is a highly resilient young man, safely breaking free from a binding spell (albeit a low-level one) and withstanding an assault from a large Hollow.[541]\nAdvanced Growth Rate: According to both Aizen and Urahara, Ichigo's most astounding ability is his growth rate; he grasps the basic control of advanced techniques in days where it would take several years for even the most gifted Shinigami. Shortly after gaining Shinigami powers and with no previous training, he began learning advanced spiritual energy sensing techniques by sheer instinct. While it takes most Shinigami at least 10 years to achieve Bankai, he did so in two-and-a-half days (albeit with the assistance of a special device invented by Urahara which was originally intended for three days).[548][549] He gains considerable experience in the use of Shunpo while training with Yoruichi, which was done over the same period as his Bankai.[550] Besides his improvements in his Shinigami abilities, Ichigo greatly increased the time he could maintain his Hollow mask, from eleven seconds to considerably longer amounts of time. During his first fight with Ulquiorra, he is instantly incapacitated by one Cero blast, even with his Hollow mask (which broke within a second), but only a few hours later, he withstands another Cero from Ulquiorra without undergoing Hollowfication, and can analyze Ulquiorra's movements much better than before, when he had \"felt like [he] was fighting a machine or a statue\" and failed to predict and counter his attacks.[551][552] His latent abilities have been recognized by the Wandenreich as potent enough to make him one of the Special War Powers of Soul Society.[553] \nKeen Intellect: Despite his somewhat punkish attitude, Ichigo is analytical, perceptive, and deductive. In his high school, Ichigo's grades are almost always near the top, despite his work as a Substitute Shinigami. Aside from that, Ichigo can determine the pattern of his opponent's battle methods and form a proper counter-strategy to defeat his opponent's attacks.\nImmeasurable Spiritual Power: Ichigo has been noted on several occasions to have tremendously vast levels of spiritual energy, well-beyond most other Shinigami.[554] His spiritual power is noted to be heavy, which surprised Renji Abarai.[555] Ichigo constantly gives off Reiatsu at the level of a captain.[556] Even when worn-out in battle, he can continue fighting effectively while still using Getsuga Tenshō and his Bankai.[557] Even at less than half strength, his spiritual energy is comparable to a captain-level fighter.[558] His energy is strong enough to hold back the Sōkyoku, a halberd with the destructive force equivalent to one million Zanpakutō combined, using only his Zanpakutō.[559] Even before his Dangai training, his spiritual energy was strong enough for him to be able to sense Aizen's increased Reiatsu as a result of his Second Fusion with the Hōgyoku while fighting Gin from a considerable distance away, despite his father, Urahara, and Yoruichi, all former Gotei 13 Captains, being unable to do so themselves while fighting him directly.[560][561] His Reiatsu is golden yellow in color.[562] After his training at the Soul King Palace, Ichigo was able to overwhelm four Sternritter simultaneously[563] and then calmly fight on par with a Sternritter using Quincy: Vollständig using just his Shikai and eventually overpower his foe.[564]\nSpiritual Awareness: Since he was a child, Ichigo has had an innate ability to clearly see spiritual beings and sense their presence. After becoming a Shinigami, his senses have continued to improve with time, learning various advanced sensing techniques, such as using a spirit ribbon to find Yūichi Shibata (in bird form).[570] Even from a considerable distance, he can detect the condition of a being with spiritual power. During his intense fight against Kenpachi Zaraki, he clearly sensed and recognized Sado's energy signature even as it weakened, despite the considerable distance between them.[571]\nMaster Swordsman: In terms of fighting style while in his Shinigami form, Ichigo relies mainly on swordplay. Aside from his initial training with Urahara, he is essentially on a \"learn as you go\" training regimen; thusly, his skill has developed by fighting rather than formal instruction, becoming even more capable with every fight. His overall skill allows him to fight evenly against sword masters of Byakuya Kuchiki and Kenpachi Zaraki's caliber. While usually fighting right-handed, Ichigo appears to be ambidextrous, as he is proficient in wielding Zangetsu in his left hand.[572][573][574] Since attaining the true form of Zangetsu, he has displayed great skill at wielding both blades at once without any trouble.[575][576][577][578][579][580]\nShunpo Expert: Though not particularly versed in its various techniques, Ichigo is proficient enough in the technique itself to keep up with and even surprise high-level Shinigami with his speed. Byakuya Kuchiki, one of the most proficient users of Shunpo in Soul Society, complimented Ichigo's growing mastery of the technique.[581] During his first demonstration of this skill, he knocked out three lieutenants and grabbed his Zanpakutō before any of them hit the ground.[540] After returning from the Soul King Palace, Ichigo has refined his skill in Shunpo, moving several miles in a single leap while simultaneously bypassing the perception of multiple Sternritter.[582]\nEnhanced Strength: When he is in his Shinigami body, Ichigo's already impressive strength is greatly enhanced. He has knocked out three Shinigami lieutenants with a single punch each, one of which shattered one of their Zanpakutō at the same time.[540] His strength is great enough to easily stop repeated axe blows from Jidanbō before shattering Jidanbō's axes in a single swing, and hurl Rukia a dozen meters into Renji's arms and send them both skidding several meters more, achieving both feats with a single hand.[583][584] With a single kick, he can break down and launch a large chunk of a stone wall.[585] After regaining his Shinigami powers, one swing from his Zanpakutō produced a shockwave powerful enough to overwhelm Kūgo Ginjō, making the Fullbringer mistake it for a Getsuga Tenshō.[586] When fighting Quilge Opie, Ichigo grabbed one of his Heilig Pfeil with his bare hand without sustaining any damage, despite the considerable explosion it caused when Ichigo threw it back.[587] After returning from the Soul King Palace, Ichigo has increased in strength, allowing him to throw four Sternritter into separate buildings in rapid succession without any visible effort.[588]\nImmense Endurance: When in his Shinigami form, Ichigo's endurance is strengthened to the point where he can continue fighting effectively after receiving many injuries, and can survive attacks which would easily kill normal Humans. It was stated by Rukia that a Shinigami's life force is their spiritual power. As such, Ichigo can withstand attacks which would be fatal to most Shinigami.[589] Uryū once stated Ichigo was a monster in this regard,[590] and Aizen commented on his ability to continue moving despite grave injuries.[591]\nEnhanced Durability: Ichigo becomes much more durable in his Shinigami form. During his last fight with Kūgo Ginjō, he withstood a direct hit from the Getsuga Tenshō created by his opponent, and the damage was only done to one of his arms and part of his face.[592] When fighting Quilge Opie, Ichigo withstood the impact of several Heilig Pfeil fired at him, unharmed, despite the powerful explosion each one caused.[593] Tenjirō Kirinji, a member of the Royal Guard, was amazed at Ichigo's ability to endure the unique healing properties of his White Skeleton Pond and Blood Hell Pond for so long after fully healing without rotting.[594] After his training in the Soul King Palace, his durability has increased to the point where he can withstand a direct attack from Meninas McAllon with only scratches on his face and retain the ability to move afterward, something which Robert Accutrone commended him for.[595]\nZangetsu (斬月, Slaying Moon)\n\n\nBlut (血装 (ブルート), burūto; German for \"Blood,\" Japanese for \"Blood Guise\"): A Quincy ability which gives one inhuman defensive & offensive capability. \n\nThe anime has frequently downplayed the extent of the injuries inflicted by and upon Ichigo, including reducing the amount of bleeding[541][752] and burn marks,[753][754] showing extreme injuries in shillouette such as the Hollow Hexapodus being stabbed in the head,[755][756] or generally reducing the severity of injuries.[757][758]\n",
  "appearance": [
    "Ichigo's most distinguishing feature is his spiky orange hair, a trait he has been ridiculed about for years on end. He is a fairly tall, lean-built young man with peach skin and brown eyes. He likes to wear slim fitting clothes.[8] He has a tendency to wear shirts patterned with the number 15 because his name is a homonym for the number.[9] Since becoming a Shinigami, he has become noticeably more muscular, as noted by his sister Karin.[10] When in his spiritual form, Ichigo wears the standard Shinigami attire, with the addition of a strap across his chest. Initially, it was a thick brown belt to hold his Zanpakutō sheath, but it later became a red rosary-like strap after awakening his own Shinigami powers.[11] It is shaped like a kite with a flat top and bottom.[12] Ichigo's appearance has caused several people, including Jūshirō Ukitake, to note a similarity to Kaien Shiba, the former lieutenant of the 13th Division.[13] After training in the Dangai, Ichigo's hair grows considerably, and he is noticeably taller, as stated by his friends.[14] After Ichigo loses his Shinigami powers, his appearance reverts to the way it was before his Dangai training.[15]",
    "Seventeen months after defeating Aizen, Ichigo's overall appearance does not change, but he becomes taller again and grows sideburns.[16] After regaining his powers, seemingly caused by remaining energy from his Fullbring,[17] Ichigo's Shinigami attire consists of a thicker strap across his chest. He has four black vertical lines on his forearms and black, tattoo-like bands crossing over his chest, wrists, and ankles. Similar bands, but with white ends, lie around his neck as collars.[18] ",
    "After training at the Soul King Palace, Ichigo wears his standard black shihakushō, but with some notable changes: he has two white shoulder plates crossing his chest in an X shape that hold his Shikai blades in place, with the first plate on his left shoulder having three sections adorned with red scales, the second plate having three sections adorned with red scales on his right waist,[19] and a white cloak with black markings tied around his waist.[20]",
    "",
    ""
  ]
}